import {
    Chart as ChartJS,
    CategoryScale,
    LinearScale,
    PointElement,
    LineElement,
    Title,
    Tooltip,
    Legend,
} from 'chart.js'
import {
    BrowserRouter as Router,
    Routes,
    Route,
    Link, useNavigate
} from "react-router-dom"
import './App.css';
import React, {useEffect, useState} from "react";
import Auth from "./Auth/Auth";
import Demo from "./Demo/Demo";
import Main from "./Main/Main";
import Reports from "./Reports/Reports";
import Maps from "./Maps/Maps";
import 'bootstrap/dist/css/bootstrap.min.css';
import SpreadSheets from "./SpreadSheets/SpreadSheets";
import Video from "./Video/Video";
import Notifications from "./Notifications/Notifications";
import Transports from "./Transports/Transports";
import Transport from "./Transport/Transport";
import ControlledObject from "./ControlledObject/ControlledObject";
import {Navigate, useParams} from "react-router";
import LuckyExcel from 'luckyexcel'
import RedirectJsRouter from "./RedirectJsRouter";
import getData from "./TempData"

ChartJS.register(
    CategoryScale,
    LinearScale,
    PointElement,
    LineElement,
    Title,
    Tooltip,
    Legend
)

const resultData = getData()

function App() {

    const [objects, setObjects] = useState([
        {
            id: 1, name: 'Магистральный газопровод “Сила Сибири”',
            transport: [
                {
                    name: "УРАЛ ППУА",
                    lat: 58.628144,
                    lng: 125.407282,
                    description: 'Топливо: 27.3\n' +
                        'Водитель: Иван Петров\n' +
                        'Режим работы двигателя: нагрузка\n' +
                        'Скорость: 40 км/ч\n' +
                        'Местоположение: 58.628144 125.407282',
                    isMarker: false,
                    data: [[{'value': 'id'}, {'value': 'Дата'}, {'value': 'Пробег, км'}, {'value': 'Время движения час:мин:сек'}, {'value': 'Время работы двигателя, час:мин:сек'}, {'value': 'Время работы двигателя в движении, час:мин:сек'}, {'value': 'Время работы двигателя без движения, час:мин:сек'}, {'value': 'Время работы двигателя на холостом ходу, час:мин:сек'}, {'value': 'Время работы двигателя на нормальных оборотах, час:мин:сек'}, {'value': 'Время работы двигателя на предельных оборотах, час:мин:сек'}, {'value': 'Время с выключенным двигателем, час:мин:сек'}, {'value': 'Время работы двигателя под нагрузкой, час:мин:сек'}, {'value': 'Начальный объём, л.1'}, {'value': 'Конечный объём, л.1'}], [{'value': 734}, {'value': '01.12.2021'}, {'value': 1.21}, {'value': '00:04:57'}, {'value': '01:08:11'}, {'value': '00:04:57'}, {'value': '01:03:14'}, {'value': '00:11:51'}, {'value': '00:56:20'}, {'value': '00:00:00'}, {'value': '22:51:49'}, {'value': '00:56:20'}, {'value': 315.4}, {'value': 297}], [{'value': 734}, {'value': '02.12.2021'}, {'value': 1.04}, {'value': '00:03:27'}, {'value': '05:49:34'}, {'value': '00:03:26'}, {'value': '05:46:08'}, {'value': '05:47:01'}, {'value': '00:02:33'}, {'value': '00:00:00'}, {'value': '18:10:26'}, {'value': '00:02:33'}, {'value': 294.3}, {'value': 245.4}], [{'value': 734}, {'value': '03.12.2021'}, {'value': 1.72}, {'value': '00:04:12'}, {'value': '03:01:58'}, {'value': '00:04:12'}, {'value': '02:57:46'}, {'value': '02:37:20'}, {'value': '00:24:38'}, {'value': '00:00:00'}, {'value': '20:58:02'}, {'value': '00:24:38'}, {'value': 244.9}, {'value': 217.8}], [{'value': 734}, {'value': '04.12.2021'}, {'value': 0.43}, {'value': '00:10:29'}, {'value': '07:01:23'}, {'value': '00:10:29'}, {'value': '06:50:54'}, {'value': '06:58:17'}, {'value': '00:03:06'}, {'value': '00:00:00'}, {'value': '16:58:37'}, {'value': '00:03:06'}, {'value': 217}, {'value': 176.9}], [{'value': 734}, {'value': '05.12.2021'}, {'value': 1.23}, {'value': '00:05:14'}, {'value': '02:33:22'}, {'value': '00:05:02'}, {'value': '02:28:20'}, {'value': '02:29:52'}, {'value': '00:03:30'}, {'value': '00:00:00'}, {'value': '21:26:38'}, {'value': '00:03:30'}, {'value': 174.1}, {'value': 127.6}], [{'value': 734}, {'value': '06.12.2021'}, {'value': 0.69}, {'value': '00:04:24'}, {'value': '06:26:02'}, {'value': '00:04:24'}, {'value': '06:21:38'}, {'value': '06:17:17'}, {'value': '00:08:45'}, {'value': '00:00:00'}, {'value': '17:33:58'}, {'value': '00:08:45'}, {'value': 128}, {'value': 106.5}], [{'value': 734}, {'value': '07.12.2021'}, {'value': 3.05}, {'value': '00:05:27'}, {'value': '06:05:49'}, {'value': '00:05:25'}, {'value': '06:00:24'}, {'value': '05:59:35'}, {'value': '00:06:14'}, {'value': '00:00:00'}, {'value': '17:54:11'}, {'value': '00:06:14'}, {'value': 107.1}, {'value': 486.1}], [{'value': 734}, {'value': '08.12.2021'}, {'value': 11.56}, {'value': '00:29:59'}, {'value': '09:06:30'}, {'value': '00:29:59'}, {'value': '08:36:31'}, {'value': '07:18:30'}, {'value': '01:48:00'}, {'value': '00:00:00'}, {'value': '14:53:30'}, {'value': '01:48:00'}, {'value': 488.6}, {'value': 467.7}], [{'value': 734}, {'value': '09.12.2021'}, {'value': 0.69}, {'value': '00:05:12'}, {'value': '08:52:20'}, {'value': '00:05:12'}, {'value': '08:47:08'}, {'value': '08:24:37'}, {'value': '00:27:43'}, {'value': '00:00:00'}, {'value': '15:07:40'}, {'value': '00:27:43'}, {'value': 475.6}, {'value': 428.2}], [{'value': 734}, {'value': '10.12.2021'}, {'value': 3.01}, {'value': '00:00:00'}, {'value': '00:06:01'}, {'value': '00:00:00'}, {'value': '00:06:01'}, {'value': '00:06:01'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '23:53:59'}, {'value': '00:00:00'}, {'value': 428}, {'value': 427.8}], [{'value': 734}, {'value': '11.12.2021'}, {'value': 2.18}, {'value': '00:04:13'}, {'value': '02:51:24'}, {'value': '00:04:13'}, {'value': '02:47:11'}, {'value': '02:49:15'}, {'value': '00:02:09'}, {'value': '00:00:00'}, {'value': '21:08:36'}, {'value': '00:02:09'}, {'value': 427.8}, {'value': 381.4}], [{'value': 734}, {'value': '12.12.2021'}, {'value': 1.45}, {'value': '00:08:51'}, {'value': '01:12:06'}, {'value': '00:08:51'}, {'value': '01:03:15'}, {'value': '01:05:13'}, {'value': '00:06:53'}, {'value': '00:00:00'}, {'value': '22:47:54'}, {'value': '00:06:53'}, {'value': 381.4}, {'value': 358.9}], [{'value': 734}, {'value': '13.12.2021'}, {'value': 0.3}, {'value': '00:02:30'}, {'value': '00:03:00'}, {'value': '00:02:30'}, {'value': '00:00:30'}, {'value': '00:03:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '23:57:00'}, {'value': '00:00:00'}, {'value': 358.8}, {'value': 358.7}], [{'value': 734}, {'value': '14.12.2021'}, {'value': 0.16}, {'value': '00:00:39'}, {'value': '01:09:59'}, {'value': '00:00:39'}, {'value': '01:09:20'}, {'value': '01:09:59'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '22:50:01'}, {'value': '00:00:00'}, {'value': 359.7}, {'value': 338.4}], [{'value': 734}, {'value': '15.12.2021'}, {'value': 0.5}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': 351.7}, {'value': 351.8}], [{'value': 734}, {'value': '16.12.2021'}, {'value': 0.2}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': 351.9}, {'value': 351.9}], [{'value': 734}, {'value': '17.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': 0}, {'value': 0}], [{'value': 734}, {'value': '18.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': 351.9}, {'value': 351.9}], [{'value': 734}, {'value': '19.12.2021'}, {'value': 1}, {'value': '00:03:50'}, {'value': '01:43:00'}, {'value': '00:03:50'}, {'value': '01:39:10'}, {'value': '01:17:30'}, {'value': '00:25:30'}, {'value': '00:00:00'}, {'value': '22:17:00'}, {'value': '00:25:30'}, {'value': 351.9}, {'value': 300.2}], [{'value': 734}, {'value': '20.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': 309}, {'value': 309}], [{'value': 734}, {'value': '21.12.2021'}, {'value': 0.71}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': 309}, {'value': 309.4}], [{'value': 734}, {'value': '22.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': 0}, {'value': 0}], [{'value': 734}, {'value': '23.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': 0}, {'value': 0}], [{'value': 734}, {'value': '24.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': 0}, {'value': 0}], [{'value': 734}, {'value': '25.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': 310.9}, {'value': 310.9}], [{'value': 734}, {'value': '26.12.2021'}, {'value': 6.44}, {'value': '00:04:11'}, {'value': '01:24:02'}, {'value': '00:04:11'}, {'value': '01:19:51'}, {'value': '01:20:32'}, {'value': '00:03:30'}, {'value': '00:00:00'}, {'value': '22:35:58'}, {'value': '00:03:30'}, {'value': 310.9}, {'value': 286.7}], [{'value': 734}, {'value': '27.12.2021'}, {'value': 2.04}, {'value': '00:04:27'}, {'value': '00:08:27'}, {'value': '00:04:27'}, {'value': '00:04:00'}, {'value': '00:08:27'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '23:51:33'}, {'value': '00:00:00'}, {'value': 286.3}, {'value': 286.3}], [{'value': 734}, {'value': '28.12.2021'}, {'value': 4.8}, {'value': '00:04:48'}, {'value': '02:16:01'}, {'value': '00:04:48'}, {'value': '02:11:13'}, {'value': '02:11:58'}, {'value': '00:04:03'}, {'value': '00:00:00'}, {'value': '21:43:59'}, {'value': '00:04:03'}, {'value': 286.4}, {'value': 242.1}], [{'value': 734}, {'value': '29.12.2021'}, {'value': 6.47}, {'value': '00:02:17'}, {'value': '00:05:00'}, {'value': '00:02:17'}, {'value': '00:02:43'}, {'value': '00:05:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '23:55:00'}, {'value': '00:00:00'}, {'value': 241.2}, {'value': 241.2}], [{'value': 734}, {'value': '30.12.2021'}, {'value': 3.58}, {'value': '00:03:57'}, {'value': '01:44:27'}, {'value': '00:03:57'}, {'value': '01:40:30'}, {'value': '01:41:27'}, {'value': '00:03:00'}, {'value': '00:00:00'}, {'value': '22:15:33'}, {'value': '00:03:00'}, {'value': 240.9}, {'value': 235.8}], [{'value': 734}, {'value': '31.12.2021'}, {'value': 1.49}, {'value': '00:05:16'}, {'value': '02:43:24'}, {'value': '00:04:46'}, {'value': '02:38:38'}, {'value': '02:43:24'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '21:15:36'}, {'value': '00:00:00'}, {'value': 235.3}, {'value': 185.1}]],
                    cameras: ["Камера 1", "Камера 2", "Камера 3"],
                    type: 'Тягач',
                    serialNumber: "245865841515",
                    state: "В работе",
                    noise: '83 дБА',
                    year: '2017',
                    maxConstructiveSpeed: '40 км/ч',
                    driver: 'Иванов Иван Иванович',
                    volumeConsumption: '28 л / 100 км'
                },
                {
                    name: "УРАЛ МКД",
                    lat: 59.584889,
                    lng: 122.015723,
                    description: 'Топливо: 45.9\n' +
                        'Водитель: Иван Петров\n' +
                        'Режим работы двигателя: простой\n' +
                        'Скорость: 0 км/ч\n' +
                        'Местоположение: 59.584889 122.015723',
                    isMarker: false,
                    data: [[{'value': 'id'}, {'value': 'Дата'}, {'value': 'Пробег, км'}, {'value': 'Время движения час:мин:сек'}, {'value': 'Время работы двигателя, час:мин:сек'}, {'value': 'Время работы двигателя в движении, час:мин:сек'}, {'value': 'Время работы двигателя без движения, час:мин:сек'}, {'value': 'Время работы двигателя на холостом ходу, час:мин:сек'}, {'value': 'Время работы двигателя на нормальных оборотах, час:мин:сек'}, {'value': 'Время работы двигателя на предельных оборотах, час:мин:сек'}, {'value': 'Время с выключенным двигателем, час:мин:сек'}, {'value': 'Время работы двигателя под нагрузкой, час:мин:сек'}, {'value': 'Начальный объём, л.1'}, {'value': 'Конечный объём, л.1'}], [{'value': 915}, {'value': '01.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 915}, {'value': '02.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 915}, {'value': '03.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 915}, {'value': '04.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 915}, {'value': '05.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 915}, {'value': '06.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 915}, {'value': '07.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 915}, {'value': '08.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 915}, {'value': '09.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 915}, {'value': '10.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 915}, {'value': '11.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 915}, {'value': '12.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 915}, {'value': '13.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 915}, {'value': '14.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 915}, {'value': '15.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 915}, {'value': '16.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 915}, {'value': '17.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 915}, {'value': '18.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 915}, {'value': '19.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 915}, {'value': '20.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 915}, {'value': '21.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 915}, {'value': '22.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 915}, {'value': '23.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 915}, {'value': '24.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 915}, {'value': '25.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 915}, {'value': '26.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 915}, {'value': '27.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 915}, {'value': '28.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 915}, {'value': '29.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 915}, {'value': '30.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 915}, {'value': '31.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 158}, {'value': '01.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}]],
                    cameras: ["Камера 1", "Камера 2", "Камера 3"],
                    type: 'Тягач',
                    serialNumber: "245865841515",
                    state: "В работе",
                    noise: '83 дБА',
                    year: '2017',
                    maxConstructiveSpeed: '40 км/ч',
                    driver: 'Иванов Иван Иванович',
                    volumeConsumption: '28 л / 100 км'
                },
                {
                    name: "УРАЛ Тягач с КМУ 1",
                    lat: 60.400061,
                    lng: 109.849519,
                    description: 'Топливо: 30.6\n' +
                        'Водитель: Иван Петров\n' +
                        'Режим работы двигателя: нагрузка\n' +
                        'Скорость: 10 км/ч\n' +
                        'Местоположение: 60.400061 109.849519',
                    isMarker: false,
                    data: [[{'value': 'id'}, {'value': 'Дата'}, {'value': 'Пробег, км'}, {'value': 'Время движения час:мин:сек'}, {'value': 'Время работы двигателя, час:мин:сек'}, {'value': 'Время работы двигателя в движении, час:мин:сек'}, {'value': 'Время работы двигателя без движения, час:мин:сек'}, {'value': 'Время работы двигателя на холостом ходу, час:мин:сек'}, {'value': 'Время работы двигателя на нормальных оборотах, час:мин:сек'}, {'value': 'Время работы двигателя на предельных оборотах, час:мин:сек'}, {'value': 'Время с выключенным двигателем, час:мин:сек'}, {'value': 'Время работы двигателя под нагрузкой, час:мин:сек'}, {'value': 'Начальный объём, л.1'}, {'value': 'Конечный объём, л.1'}], [{'value': 158}, {'value': '01.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 158}, {'value': '02.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 158}, {'value': '03.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 158}, {'value': '04.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 158}, {'value': '05.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 158}, {'value': '06.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 158}, {'value': '07.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 158}, {'value': '08.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 158}, {'value': '09.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 158}, {'value': '10.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 158}, {'value': '11.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 158}, {'value': '12.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 158}, {'value': '13.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 158}, {'value': '14.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 158}, {'value': '15.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 158}, {'value': '16.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 158}, {'value': '17.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 158}, {'value': '18.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 158}, {'value': '19.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 158}, {'value': '20.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 158}, {'value': '21.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 158}, {'value': '22.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 158}, {'value': '23.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 158}, {'value': '24.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 158}, {'value': '25.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 158}, {'value': '26.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 158}, {'value': '27.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 158}, {'value': '28.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 158}, {'value': '29.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 158}, {'value': '30.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 158}, {'value': '31.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}]],
                    cameras: ["Камера 1", "Камера 2", "Камера 3"],
                    type: 'Тягач',
                    serialNumber: "245865841515",
                    state: "В работе",
                    noise: '83 дБА',
                    year: '2017',
                    maxConstructiveSpeed: '40 км/ч',
                    driver: 'Иванов Иван Иванович',
                    volumeConsumption: '28 л / 100 км'
                },
                {
                    name: "УРАЛ Тягач с КМУ 2",
                    lat: 57.000784,
                    lng: 107.433185,
                    description: 'Топливо: -\n' +
                        'Водитель: Иван Петров\n' +
                        'Режим работы двигателя: -\n' +
                        'Скорость: - км/ч\n' +
                        'Местоположение: 57.000784 107.433185',
                    isMarker: false,
                    data: [[{'value': 'id'}, {'value': 'Дата'}, {'value': 'Пробег, км'}, {'value': 'Время движения час:мин:сек'}, {'value': 'Время работы двигателя, час:мин:сек'}, {'value': 'Время работы двигателя в движении, час:мин:сек'}, {'value': 'Время работы двигателя без движения, час:мин:сек'}, {'value': 'Время работы двигателя на холостом ходу, час:мин:сек'}, {'value': 'Время работы двигателя на нормальных оборотах, час:мин:сек'}, {'value': 'Время работы двигателя на предельных оборотах, час:мин:сек'}, {'value': 'Время с выключенным двигателем, час:мин:сек'}, {'value': 'Время работы двигателя под нагрузкой, час:мин:сек'}, {'value': 'Начальный объём, л.1'}, {'value': 'Конечный объём, л.1'}], [{'value': 757}, {'value': '01.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 757}, {'value': '02.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 757}, {'value': '03.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 757}, {'value': '04.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 757}, {'value': '05.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 757}, {'value': '06.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 757}, {'value': '07.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 757}, {'value': '08.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 757}, {'value': '09.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 757}, {'value': '10.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 757}, {'value': '11.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 757}, {'value': '12.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 757}, {'value': '13.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 757}, {'value': '14.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 757}, {'value': '15.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 757}, {'value': '16.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 757}, {'value': '17.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 757}, {'value': '18.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 757}, {'value': '19.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 757}, {'value': '20.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 757}, {'value': '21.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 757}, {'value': '22.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 757}, {'value': '23.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 757}, {'value': '24.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 757}, {'value': '25.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 757}, {'value': '26.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 757}, {'value': '27.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 757}, {'value': '28.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 757}, {'value': '29.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 757}, {'value': '30.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 757}, {'value': '31.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}]],
                    cameras: ["Камера 1", "Камера 2", "Камера 3"],
                    type: 'Тягач',
                    serialNumber: "245865841515",
                    state: "В работе",
                    noise: '83 дБА',
                    year: '2017',
                    maxConstructiveSpeed: '40 км/ч',
                    driver: 'Иванов Иван Иванович',
                    volumeConsumption: '28 л / 100 км'
                },
                {
                    name: "KOMATSU PC400 Экскаватор 1",
                    lat: 60.252234,
                    lng: 110.264014,
                    description: 'Топливо: 25.9\n' +
                        'Водитель: Иван Петров\n' +
                        'Режим работы двигателя: нагрузка\n' +
                        'Скорость: 5 км/ч\n' +
                        'Местоположение: 60.252234 110.264014',
                    isMarker: false,
                    data: [[{'value': 'id'}, {'value': 'Дата'}, {'value': 'Пробег, км'}, {'value': 'Время движения час:мин:сек'}, {'value': 'Время работы двигателя, час:мин:сек'}, {'value': 'Время работы двигателя в движении, час:мин:сек'}, {'value': 'Время работы двигателя без движения, час:мин:сек'}, {'value': 'Время работы двигателя на холостом ходу, час:мин:сек'}, {'value': 'Время работы двигателя на нормальных оборотах, час:мин:сек'}, {'value': 'Время работы двигателя на предельных оборотах, час:мин:сек'}, {'value': 'Время с выключенным двигателем, час:мин:сек'}, {'value': 'Время работы двигателя под нагрузкой, час:мин:сек'}, {'value': 'Начальный объём, л.1'}, {'value': 'Конечный объём, л.1'}], [{'value': 783}, {'value': '01.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 783}, {'value': '02.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 783}, {'value': '03.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 783}, {'value': '04.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 783}, {'value': '05.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 783}, {'value': '06.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 783}, {'value': '07.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 783}, {'value': '08.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 783}, {'value': '09.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 783}, {'value': '10.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 783}, {'value': '11.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 783}, {'value': '12.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 783}, {'value': '13.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 783}, {'value': '14.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 783}, {'value': '15.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 783}, {'value': '16.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 783}, {'value': '17.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 783}, {'value': '18.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 783}, {'value': '19.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 783}, {'value': '20.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 783}, {'value': '21.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 783}, {'value': '22.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 783}, {'value': '23.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 783}, {'value': '24.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 783}, {'value': '25.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 783}, {'value': '26.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 783}, {'value': '27.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 783}, {'value': '28.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 783}, {'value': '29.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 783}, {'value': '30.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}], [{'value': 783}, {'value': '31.12.2021'}, {'value': 0}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': '00:00:00'}, {'value': ''}, {'value': '00:00:00'}, {'value': ''}, {'value': ''}]],
                    cameras: ["Камера 1", "Камера 2", "Камера 3"],
                    type: 'Тягач',
                    serialNumber: "245865841515",
                    state: "В работе",
                    noise: '83 дБА',
                    year: '2017',
                    maxConstructiveSpeed: '40 км/ч',
                    driver: 'Иванов Иван Иванович',
                    volumeConsumption: '28 л / 100 км'
                },
            ],
            data: {
                dataConsumptionHour: [
                    {
                        "month": "Декабрь",
                        "consumption": 3.24,
                    },
                    {
                        "month": "Январь",
                        "consumption": 3.17,
                    },
                    {
                        "month": "Февраль",
                        "consumption": 2.29,
                    },
                    {
                        "month": "Март",
                        "consumption": 15.6,
                    },
                ],
                dataObjects: [
                    {
                        "id": "Нет данных",
                        "data": [
                            {
                                "x": "Объекты",
                                "y": 3
                            },
                        ]
                    },
                    {
                        "id": "Со сливами",
                        "data": [
                            {
                                "x": "Объекты",
                                "y": 0
                            },
                        ]
                    },
                    {
                        "id": "В порядке",
                        "data": [
                            {
                                "x": "Объекты",
                                "y": 3
                            },
                        ]
                    },
                ],
                dataConsumptionLiters: [
                    {
                        "month": "Декабрь",
                        "consumption": 31,
                    },
                    {
                        "month": "Январь",
                        "consumption": 50,
                    },
                    {
                        "month": "Февраль",
                        "consumption": 28,
                    },
                    {
                        "month": "Март",
                        "consumption": 15,
                    },
                ],
                dataWorkMinutes: [
                    {
                        "month": "Декабрь",
                        "minutes": 2,
                    },
                    {
                        "month": "Январь",
                        "minutes": 15,
                    },
                    {
                        "month": "Февраль",
                        "minutes": 3,
                    },
                    {
                        "month": "Март",
                        "minutes": 6,
                    },
                ],
                dataSinkVolume: [
                    {
                        "month": "Декабрь",
                        "volume": 0,
                    },
                    {
                        "month": "Январь",
                        "volume": 686,
                    },
                    {
                        "month": "Февраль",
                        "volume": 0,
                    },
                    {
                        "month": "Март",
                        "volume": 0,
                    },
                ],
                dataConsumptionCurrent: [
                    {
                        "month": "Декабрь",
                        "consumption": 3.24,
                    },
                    {
                        "month": "Январь",
                        "consumption": 0.88,
                    },
                    {
                        "month": "Февраль",
                        "consumption": 2.29,
                    },
                    {
                        "month": "Март",
                        "consumption": 1.01,
                    },
                ]

            },
            notifications: [
                {
                    datetime: '22.04.2021 12:45',
                    isPositive: false,
                    title: 'Превышение скорости',
                    description: 'Превышение скорости на транспортном средстве Mercedes-3341 Самосвал 1'
                },
                {
                    datetime: '22.06.2021 16:50',
                    isPositive: true,
                    title: 'Строительство на Участке 5 завершено',
                    description: 'Строительство линейной части газопровода на Участке 5 завершено'
                },
                {
                    datetime: '22.04.2021 12:45',
                    isPositive: false,
                    title: 'Превышение скорости',
                    description: 'Превышение скорости на транспортном средстве Mercedes-3341 Самосвал 1'
                },
                {
                    datetime: '22.06.2021 16:50',
                    isPositive: true,
                    title: 'Строительство на Участке 5 завершено',
                    description: 'Строительство линейной части газопровода на Участке 5 завершено'
                },
                {
                    datetime: '22.04.2021 16:51',
                    isPositive: false,
                    title: 'Превышение скорости',
                    description: 'Превышение скорости на транспортном средстве Mercedes-3341 Самосвал 1'
                },
                {
                    datetime: '22.06.2021 16:52',
                    isPositive: true,
                    title: 'Строительство на Участке 5 завершено',
                    description: 'Строительство линейной части газопровода на Участке 5 завершено'
                },
                {
                    datetime: '22.04.2021 17:57',
                    isPositive: false,
                    title: 'Превышение скорости',
                    description: 'Превышение скорости на транспортном средстве Mercedes-3341 Самосвал 1'
                },
                {
                    datetime: '22.06.2021 18:01',
                    isPositive: true,
                    title: 'Строительство на Участке 5 завершено',
                    description: 'Строительство линейной части газопровода на Участке 5 завершено'
                },
            ]
        },
        {id: 2, name: 'Газопровод-отвод на ГРС “Врангель”', transport: [], data: {}, notifications: []},
        {
            id: 3,
            name: 'Система магистральных газопроводов “Бованенково-Ухта”',
            transport: [],
            data: {},
            notifications: []
        },
        {id: 4, name: 'Система магистральных газопроводов “Ухта-Торжок”', transport: [], data: {}, notifications: []},
        {id: 5, name: 'Харасавэйское газоконденсатное месторождение', transport: [], data: {}, notifications: []},
        {id: 6, name: 'Уренгойское нефтегазоконденсатное месторождение', transport: [], data: {}, notifications: []},
    ])

    const [userMapPoints, setUserMapPoints] = useState([]);
    const [isPointsAdditionState, setPointsAdditionState] = useState(false);

    let {id} = useParams();

    const [luckyConfig, setLuckyConfig] = useState({
        container: "luckysheet",
        title: 'Данные о транспорте', // set the name of the table
        plugins: ['chart'],
        showtoolbar: true,
        data: [{
            "name": "Sheet1",
            color: "",
            "status": "1",
            "order": "0",
            "data": [],
            "config": {},
            "index": 0
        }],
        myFolderUrl: `/demo/reports/${id}`
    })

    const [isLoading, setLoading] = useState(false)
    const [isUploaded, setUploaded] = useState(false)

    const fileTranform = async(file) => {
        await LuckyExcel.transformExcelToLucky(
            file,
            function(exportJson, luckysheetfile){
                if (exportJson.sheets.length > 0) {
                    const newLuckyConfig = {...luckyConfig}
                    const data = [...exportJson.sheets, ...newLuckyConfig.data]
                    newLuckyConfig.data = data
                    setLuckyConfig(newLuckyConfig)
                    setUploaded(true)
                }
                setLoading(false)
            },
            function(err){
                console.log('Import failed. Is your fail a valid xlsx?');
                setLoading(false)
            });

    }

    const fileUpload = (file) => {
        setLoading(true)
        fileTranform(file).then(() => {
            console.log("ended")
        })
    }

    const getFuelResult = () => {
        if (!isUploaded) return
        const newLuckyConfig = {...luckyConfig}
        const data = [...resultData.fuelData, ...newLuckyConfig.data]
        newLuckyConfig.data = data
        setLuckyConfig(newLuckyConfig)
    }

    const getEnginesResult = () => {
        if (!isUploaded) return
        const newLuckyConfig = {...luckyConfig}
        const data = [...resultData.engineData, ...newLuckyConfig.data]
        newLuckyConfig.data = data
        setLuckyConfig(newLuckyConfig)
    }

    const [isCamChecked, setCamChecked] = useState(Array.of(Array(15).keys()).map(() => false))

    return (
        <Router>
            <Routes>
                <Route path="login" element={<Auth/>}/>
                <Route path="demo/reports" element={<ControlledObject objects={objects} setObjects={setObjects}
                                                                      userMapPoints={userMapPoints}
                                                                      isLoading={isLoading}
                                                                      setUserMapPoints={setUserMapPoints}
                                                                      getFuelResult={getFuelResult}
                                                                      getEnginesResult={getEnginesResult}
                                                                      isPointsAdditionState={isPointsAdditionState}
                                                                      fileUpload={fileUpload}
                                                                      isCamChecked={isCamChecked}
                                                                      setCamChecked={setCamChecked}
                                                                      setPointsAdditionState={setPointsAdditionState}/>}>
                    <Route path={":id"}
                           element={<Reports objects={objects}/>}>
                        <Route path={"positions"} element={
                            <Maps objects={objects} userMapPoints={userMapPoints}
                                  setUserMapPoints={setUserMapPoints}
                                  isPointsAdditionState={isPointsAdditionState}
                                  setPointsAdditionState={setPointsAdditionState}/>
                        }/>
                        {/*<Route path={"expendPlugins/chart/*"} element={<RedirectJsRouter/>}/>*/}
                        <Route path={"sheets"} element={<SpreadSheets objects={objects} luckyConfig={luckyConfig} setLuckyConfig={setLuckyConfig}/>}/>
                        <Route path={"video"} element={<Video isCamChecked={isCamChecked} setCamChecked={setCamChecked}/>}/>
                        <Route path={"notifications"} element={<Notifications objects={objects}/>}/>
                        <Route path={"transport/:transportId"} element={<Transport objects={objects}/>}/>
                        <Route path={"transport"} element={<Transports objects={objects}/>}/>
                    </Route>
                </Route>
                <Route path="demo"
                       element={<Demo objects={objects} setObjects={setObjects}/>}>
                </Route>
                <Route path="" element={<Main/>}/>
            </Routes>
        </Router>
    );
}

export default App;
